{
  "id": "home-then-hired",
  "title": "Home, Then Hired",
  "date": "2025-06-20",
  "category": "Personal",
  "tags": ["career", "job-hunting", "ai-engineering", "personal-growth"],
  "excerpt": "Two years without mom's cooking. A spreadsheet tracking 60 companies. Philosophy exams disguised as job interviews. How I landed my first AI engineering role.",
  "image": "images/home_then_hired.jpg",
  "readTime": "8 min",
  "content": "Two years.\n\nThat's how long it had been since I'd eaten my mother's cooking.\n\nShe made paneer that first night back from Bangalore. Then butter beans (my fav) the next morning. Then something else I'd forgotten existed. I kept eating. She kept making.\n\nFor two days I did absolutely nothing. Just existed in my childhood home in Mumbai. Talked to my parents face to face instead of through a phone screen. Argued with my sister about nothing important. Slept in my own bed.\n\nThen reality knocked.\n\nI needed a job.\n\n---\n\nI did what any reasonable data science graduate would do. I Googled \"AI ML engineer job Mumbai\" and immediately felt overwhelmed.\n\nEvery job description read like a wishlist. Twenty skills minimum. Experience with tools I'd barely heard of. Entry level positions asking for senior-level knowledge.\n\nSo I did something slightly obsessive.\n\nI made a spreadsheet.\n\nColumns for skills. Rows for companies. A simple yes or no at each intersection. Did Company X ask for Skill Y?\n\nI filled in 60 companies. Sixty. Only the good ones, mid to high market cap, legitimate players in AI.\n\nWhen I stepped back and looked at it, patterns emerged. The top skills repeated. The noise fell away. Suddenly I knew exactly what to study. What to put on my resume. Where to focus my limited time.\n\nHa. Sometimes the nerdiest solution is the right one.\n\n---\n\nI started applying. Got calls from good companies. Scheduled interviews.\n\nFailed them.\n\nNot on the technical stuff. I hadn't even gotten that far yet.\n\nI failed the questions that seemed easy. The ones that shouldn't require preparation.\n\n*Where do you see yourself in five years?*\n\nMy brain offered helpful answers: Earning more money if you give me raises. Marry the girl I like, hopefully. Traveling. Starting my own company maybe. Definitely not still answering this question.\n\n*What drives you?*\n\nI had no idea, just passionate about writing code.\n\n*What problems have you solved that made a real difference?*\n\nI couldn't articulate a single one convincingly.\n\nThese weren't interview questions. They were philosophy exams. And I was failing because I'd never actually thought about myself that deeply.\n\nSo I stopped applying for two days.\n\nI sat down. Wrote. Thought. Wrote more. What actually matters to me beyond salary? Where do I genuinely want to be, Mumbai or somewhere else? What work makes me feel alive versus what just pays bills?\n\nThe questions companies were asking forced me to figure out answers I needed anyway.\n\nFunny how that works.\n\n---\n\nWhen I went back to interviewing, something had shifted. I could answer those questions because I'd actually answered them for myself first. Companies noticed. I started clearing first rounds. Then technical rounds.\n\nThen came a call from a really good company.\n\nThe interview was scheduled for 11 AM. I showed up at 9.\n\nI couldn't help it. I wanted to see the place.\n\nThey walked me through their projects. Voice agents for customer support. Crash detection using computer vision. AI chatbots for fintech. A wealth manager AI agent that builds financial plans.\n\nI wanted in.\n\nFour rounds that day. Coding questions. Project discussions. Deep dives into ML foundations with the founders. GPU architecture. Latency problems. And yes, those philosophical questions again.\n\nThis time I was ready.\n\nTwo days later, the co-founder called. I was in.\n\nOne week from first application to offer letter. Starting June 16th, 2025.\n\n---\n\nBut here's the thing.\n\nThe interview wasn't what got me the job. The projects were.\n\nAnd those projects came from a very specific three months of my life.\n\nMy fourth semester was weird. Only a month of actual classes, then internship and thesis work. I'd landed a remote ML internship, four hours daily. The rest of my time was mine.\n\nI could've coasted.\n\nInstead, I built things.\n\n**KaleidoscopeChat**: An AI tutor named Shalini who explains chapters from the English NCERT 12th standard textbook, Kaleidoscope.\n\n**AI Newsletter**: Agents that search the internet for news on any topic, then format it like an actual newspaper.\n\n**FoodVision101**: Point your camera at food. It tells you what's on your plate.\n\nFive projects total. Every one went on my resume. Every one came up in interviews.\n\n---\n\nThose three months had a rhythm I still think about.\n\nI lived three kilometers from campus in a rented apartment. I'd arrive at the Campus by 7 AM, eat breakfast by 7:30, then disappear into work until evening in Mac Lab.\n\nTwelve hours in that lab, most days.\n\nI loved it there. Something about the hum of those machines. The focused silence. The occasional conversation with the BTech students who stayed late too. Our professors let us work past official hours. Small kindness, huge impact.\n\nBy 7 PM I'd pack up. Head to the mess for dinner. And here's the part that might sound strange:\n\nI looked forward to 7:30 every single day.\n\nThat's when I'd put on my headphones. Two songs on rotation. \"Dinosaur Park\" by Adam Young(Owl City). \"Can't Take My Eyes Off You\" by Frankie Valli. Then I'd eat slowly, knowing these were my last weeks of college.\n\nAfter dinner, I'd walk the campus.\n\nPast Hostel Hor04 where my best memories lived. Through the trees. Around the playground. Just absorbing it. Back to my rented room by 9:30. Call family. Sleep by 10:30.\n\nThen wake up and do it again.\n\n---\n\nI'll go back someday. Walk those paths again. See the professors. Maybe sit in the Mac lab one more time.\n\nFor now, I have a job. AI Engineer.\n\nNot because I'm brilliant. Because I did the boring work of figuring out what mattered. Built things when nobody was watching. And somewhere along the way, answered the hardest interview question of all:\n\n*Who are you, and what do you actually want?*\n\nTurns out employers aren't the only ones who need that answer.",
  "related": ["kaleidoscope-chat-ai-tutor"]
}
